tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "quick-lint/quick-lint-js", "https://github.com/quick-lint/quick-lint-js.git"

# packages
brew "cowsay" # Configurable talking characters in ASCII art
brew "fd" # Simple, fast and user-friendly alternative to find
brew "figlet" # Banner-like program prints strings as ASCII art
brew "fortune" # Infamous electronic fortune-cookie generator
brew "fzf" # Command-line fuzzy finder written in Go
brew "git" # Distributed revision control system
brew "lazygit" # Simple terminal UI for git commands
brew "lolcat" # Rainbows and unicorns in your console!
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "nghttp2" # HTTP/2 C Library
brew "node" # Platform built on V8 to build network applications
brew "nvm" # Manage multiple Node.js versions
brew "postgresql", restart_service: true # Object-relational database system
brew "postgresql@13" # Object-relational database system
brew "ruby-build" # Install various Ruby versions and implementations
brew "rbenv" # Ruby version manager
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "stow" # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "tmux" # Terminal multiplexer
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "yarn" # JavaScript package manager

#programs
brew "heroku/brew/heroku" # Everything you need to get started with Heroku
cask "github" # Desktop client for GitHub repositories
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
cask "brave-browser" # Web browser focusing on privacy
